package leigh.ai.game.feb.dto.skill;

public enum Skill {
	隔挡L1("04"),
	隔挡L2("53"),
	抗魔L1("05"),
	抗魔L2("54"),
	会心L1("03"),
	会心L2("51"),
	护身L1("14"),
	护身L2("74"),
	精准L1("06"),
	精准L2("71"),
	迷踪L1("07"),
	迷踪L2("72"),
	奥义L1("02"),
	奥义L2("73"),
	神速("17"),
	逃逸("18"),
	冲锋("12"),
	骑术大师("65"),
	疾飞("19"),
	龙鳞("67"),
	骑兵系特效("21"),
	骑兵系特效P("22"),
	骑兵系特效EX("23"),
	重甲系特效("24"),
	重甲系特效P("25"),
	重甲系特效EX("26"),
	法师系特效("27"),
	法师系特效P("28"),
	法师系特效EX("29"),
	盗贼系特效("30"),
	盗贼系特效P("31"),
	盗贼系特效EX("32"),
	剑士系特效("33"),
	剑士系特效P("34"),
	剑士系特效EX("35"),
	飞行系特效("36"),
	飞行系特效P("37"),
	飞行系特效EX("38"),
	神意("10"),
	修复("01"),
	掠夺("43"),
	偷窃("15"),
	潜行("08"),
	分解("20"),
	提炼("66"),
	努力("16"),
	探险("50"),
	;
	private String id;
	Skill(String id) {
		this.id = id;
	}
	public String getId() {
		return id;
	}
	public void setId(String id) {
		this.id = id;
	}
}
